W7/trellino_app/app/controllers/boards_controller.rb

  def update_order
    if update_order_params.length > 0
      order = 1
      update_order_params.each do |board_i|
        if board = Board.find(board_i)
          board.update(sort_id: order)
---
UPDATE "boards" SET "sort_id" = $1, "updated_at" = $2 WHERE "boards"."id" = 1  [["sort_id", 2], ["updated_at", "2014-05-18 07:34:09.711804"]]