W7/trellino_app/app/controllers/boards_controller.rb

  def create
    @board = Board.new(board_params)
    if @board.save
---
INSERT INTO "boards" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-05-16 23:13:05.808180"], ["title", "test!"], ["updated_at", "2014-05-16 23:13:05.808180"]]

  def find_board
    @board = Board.find(params[:id])
---
SELECT  "boards".* FROM "boards"  WHERE "boards"."id" = $1 LIMIT 1  [["id", 3]]