W7/trellino_app/app/controllers/cards_controller.rb

INSERT INTO "cards" ("content", "created_at", "list_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Little lamb, get off my ass."], ["created_at", "2014-05-18 09:23:51.430862"], ["list_id", 1], ["updated_at", "2014-05-18 09:23:51.430862"]]
---
  def create
    @card = Card.new(card_params)
    if @card.save

SELECT "cards".* FROM "cards"
SELECT  "lists".* FROM "lists"  WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "cards".* FROM "cards"  WHERE "cards"."list_id" = $1  [["list_id", 1]]
UPDATE "cards" SET "sort_id" = $1, "updated_at" = $2 WHERE "cards"."id" = 1  [["sort_id", 2], ["updated_at", "2014-05-18 07:41:49.658814"]]
---
  def update_order
    if params[:card].length > 0
      @list = List.find(params[:list_id])
      @list.cards.each.with_index do |card, index|
        sort_id = params[:card][index] == 0 ? index : params[:card][index]
        card.update(sort_id: sort_id)