W7/trellino_app/app/controllers/lists_controller.rb

INSERT INTO "lists" ("board_id", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["board_id", 1], ["created_at", "2014-05-16 23:20:27.544216"], ["title", "test"], ["updated_at", "2014-05-16 23:20:27.544216"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

SELECT "lists".* FROM "lists"
SELECT  "boards".* FROM "boards"  WHERE "boards"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "lists".* FROM "lists"  WHERE "lists"."board_id" = $1  [["board_id", 1]]
UPDATE "lists" SET "sort_id" = $1, "updated_at" = $2 WHERE "lists"."id" = 1  [["sort_id", 3], ["updated_at", "2014-05-18 07:41:19.216956"]]
---
  def update_order
    puts params
    if params[:list].length > 0
      @board = Board.find(params[:board_id])
      @board.lists.each.with_index do |list, index|
        sort_id = params[:list][index] == 0 ? index : params[:list][index]
        list.update(sort_id: sort_id)