W7/W7D3/news-reader/app/controllers/feeds_controller.rb

SELECT "feeds".* FROM "feeds"
---
  def index
    respond_to do |format|
      format.html { render :index }
      format.json { render :json => Feed.all }

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @feed = Feed.find(params[:id])