W7/W7D2/journal_app/app/controllers/api/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Hello!"], ["created_at", "2014-05-13 18:18:40.691510"], ["title", "Test!"], ["updated_at", "2014-05-13 18:18:40.691510"]]

  def update
    @post = Post.find(params[:id])
    if @post && @post.update(post_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 21]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = 21  [["title", "Hey you!"], ["updated_at", "2014-05-14 01:07:12.672864"]]

  def destroy
    post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]